/**
 * @author Mikhail Epatko (epatko-m-i@rambler.ru).
 * 04.02.17.
 *
 *
 * Создать меню.
 * Реализовать структуру для поддержания меню.
 * Каждый элемент меню имеет имя. Все меню должно выводиться на экран.
 * Каждый пункт меню может быть как одиночным элементом, так и иметь дочерние подпункты.
 * Все меню должно выводиться на экран в виде дерева.
 * Предусмотреть возможность определения действия, когда пользователь выбрал конкретный пункт меню.
 *
 * Например:
 * Задача 1.
 * ---- Задача 1.1.
 * --------- Задача 1.1.1.
 * --------- Задача 1.1.2.
 * ---- Задача 1.2.
 * */
package ru.epatko.taskMenu;