/**
 * 5.4.1. Реализовать коллекцию SimpleSet.
 *
 * Реализовать коллекцию SimpleSet. Коллекция должна обеспечивать void add(E e) и реализовывать Iterator<E>.
 * Коллекция не должна хранить дубликаты.
 * В этой задаче нужно сделать две реализации:
 * 1. Set - внутри для хранения данных использует обычные массивы.
 * 2. Set - внутри для хранения данных использует связанные списки (Реализация из предыдущего задания).
 *
 *
 * @author Mikhail Epatko (mikhail.epatko@gmail.com).
 * 16.02.17.
 */
package ru.epatko.sets;