/**
 * Часть 1.
 * Создать программу, которая будет считать количество слов и пробелов в тексте.
 * Необходимо создать два Thread. Первый будет считать количество слов. Второй - количество пробелов в тексте.
 * Вывести результат на экран.
 * Продемонстрировать, что программа выполняется параллельно.

 * Часть 2.
 * Необходимо, чтобы в начале запуска программы из первой части на экране выводилась информация о программе.
 * А после вычисления данных выводилась запись о завершении программы. Важно, чтобы эта информация всегда
 * выводилась в начале и в конце вычисления.
 * Предусмотреть возможность останавливать вычисления, если время вычисления превышает 1 секунду.
 * Для этого нужно реализовать проверку поведения isInterrunted().
 *
 *
 * @author Mikhail Epatko (mikhail.epatko@gmail.com).
 * 10.03.17.
 */
package ru.epatko.stringCalculator;