/**
 *  1. Создать простую структуру дерева с методами addChild(Leaf, E), List< E > getChildren().
 *  2. Написать алгоритм поиска элемента в такой структуре.
 *  3. Написать алгоритм проверки, является ли дерево сбалансированным.
 *     Балансированным деревом является дерево, у которого все узлы имеют или две ветки или ни одной.
 *  4. На базе вашей структуры усовершенствовать код - Сделать search binary tree (дерево, у которого
 *     все значения элементов с лева от корня меньше либо равны корню, а правые - больше корня).
 *  5. Используя метод бинарного поиска реализовать алгоритм поиска элемента. Сравнить скорость работы со 2 пунктом.
 *
 *
 * @author Mikhail Epatko (mikhail.epatko@gmail.com).
 * 20.02.17.
 */
package ru.epatko.myTree;