/**
 * 1. Создать модель User и три поля String name, int children, Calendar birthday.
 *
 * 2. Не перекрывая equals hashCode:
 * 2.1. Создать два объекта User, которые имеют одинаковые поля.
 * 2.2. Создать карту Map<User, Object>.
 * 2.3. Добавить два объекта в карту. Вывести карту на печать.
 * 2.4. Описать полученный результат словами.
 *
 * 3. Перекрыть hashCode:
 * 3.1. Создать два объекта User, которые имеют одинаковые поля.
 * 3.2. Создать карту Map<User, Object>.
 * 3.3. Добавить два объекта в карту. Вывести карту на печать. Описать полученный результат словами.
 *
 * 4. Перекрыть equals:
 * 4.1. Создать два объекта User, которые имеют одинаковые поля.
 * 4.2. Создать карту Map<User, Object>.
 * 4.3. Добавить два объекта в карту. Вывести карту на печать. Описать полученный результат словами.
 *
 *
 * @author Mikhail Epatko (mikhail.epatko@gmail.com).
 * 17.02.17.
 */
package ru.epatko.maps;