/**
 * 1. Сделать многопоточный счетчик: класс Count и метод increment() продемонстрировать работу через два потока.
 *
 * 2. Поиск текста в файле:
 * 2.1. Сделать обход файловой системы и поиск заданного текста в файлах.
 * Приложение должно быть многопоточным, запускаться из командной строки и принимать параметры поиска в качестве аргумента.
 * 2.2. Предусмотреть возможность останавливать поиск, если хотя бы один поток нашел совпадение.
 * Реализовать это через флаг запуска.
 *
 *
 * @author Mikhail Epatko (mikhail.epatko@gmail.com).
 * 23.03.17.
 */
package ru.epatko.synchronizing;
