package ru.epatko.chat;

/**
 * @author Mikhail Epatko (epatko-m-i@rambler.ru).
 *         24.12.16.
 */

/**
 * Создать программу консольный чат. Пользователь вводит слово-фразу,
 * программа берет случайную фразу из текстового файла и выводит в ответ.
 * Программа замолкает если пользователь вводит слово «стоп» при этом он может
 * продолжать отправлять сообщения в чат. Если пользователь вводит слово «продолжить»,
 * программа снова начинает отвечать. При вводе слова «закончить» программа прекращает работу.
 * Запись диалога включая, слова-команды стоп/продолжить/закончить записать в текстовый лог.
 * Так делать не надо. while (true) { - консольный чат. должен явно выходить из цикла.
 * Не делайте вечный цикл.
 */

public class Chat {



}
